
main:     file format elf32-littlearm


Disassembly of section .text:

20000000 <_exit>:
#include <sys/types.h>
#include <sys/stat.h>

void _exit(int a) {while(1);}
20000000:	e7fe      	b.n	20000000 <_exit>
20000002:	bf00      	nop

20000004 <_sbrk>:
void *_sbrk(int a) {}
20000004:	4770      	bx	lr
20000006:	bf00      	nop

20000008 <_write>:
int _write(int fd, const void *buf, size_t count) {}
20000008:	4770      	bx	lr
2000000a:	bf00      	nop

2000000c <_close>:
int _close(int fd) {}
2000000c:	4770      	bx	lr
2000000e:	bf00      	nop

20000010 <_fstat>:
int _fstat(int fd, struct stat *buf) {}
20000010:	4770      	bx	lr
20000012:	bf00      	nop

20000014 <_isatty>:
int _isatty(int fd) {}
20000014:	2000      	movs	r0, #0
20000016:	4770      	bx	lr

20000018 <_lseek>:
off_t _lseek(int fd, off_t offset, int whence) {}
20000018:	4770      	bx	lr
2000001a:	bf00      	nop

2000001c <_read>:
ssize_t _read(int fd, void *buf, size_t count) {}
2000001c:	2000      	movs	r0, #0
2000001e:	4770      	bx	lr

20000020 <_kill>:
int _kill(int pid, int sig) {}
20000020:	4770      	bx	lr
20000022:	bf00      	nop

20000024 <_getpid>:
20000024:	4770      	bx	lr
20000026:	bf00      	nop

20000028 <_start>:
    .global _start
    .global _exit
    .thumb

_start:
    ldr sp, =_estack 
20000028:	f8df d00c 	ldr.w	sp, [pc, #12]	@ 20000038 <_start+0x10>
    bl init_bss
2000002c:	f000 f8ce 	bl	200001cc <init_bss>
    bl main
20000030:	f000 f90e 	bl	20000250 <main>
    b _exit                   

    <45>   DW_AT_name        : (indirect string, offset: 0x20d): short int
 <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 2
    <4b>   DW_AT_encoding    : 7	(unsigned)
    <4c>   DW_AT_name        : (indirect string, offset: 0x148): short unsigned int
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 4
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0xce): long int
 <1><57>: Abbrev Number: 1 (DW_TAG_typedef)
    <58>   DW_AT_name        : (indirect string, offset: 0x116): __uint32_t
    <5c>   DW_AT_decl_file   : 2
    <5d>   DW_AT_decl_line   : 79
    <5e>   DW_AT_decl_column : 25
    <5f>   DW_AT_type        : <0x63>
 <1><63>: Abbrev Number: 3 (DW_TAG_base_type)
    <64>   DW_AT_byte_size   : 4
    <65>   DW_AT_encoding    : 7	(unsigned)
    <66>   DW_AT_name        : (indirect string, offset: 0x97): long unsigned int
 <1><6a>: Abbrev Number: 3 (DW_TAG_base_type)
    <6b>   DW_AT_byte_size   : 8
    <6c>   DW_AT_encoding    : 5	(signed)
    <6d>   DW_AT_name        : (indirect string, offset: 0xc9): long long int
 <1><71>: Abbrev Number: 1 (DW_TAG_typedef)
    <72>   DW_AT_name        : (indirect string, offset: 0xb3): __int_least64_t
    <76>   DW_AT_decl_file   : 2
    <77>   DW_AT_decl_line   : 200
    <78>   DW_AT_decl_column : 30
    <79>   DW_AT_type        : <0x6a>
 <1><7d>: Abbrev Number: 17 (DW_TAG_base_type)
    <7e>   DW_AT_byte_size   : 4
    <7f>   DW_AT_encoding    : 5	(signed)
    <80>   DW_AT_name        : int
 <1><84>: Abbrev Number: 1 (DW_TAG_typedef)
    <85>   DW_AT_name        : (indirect string, offset: 0x1da): size_t
    <89>   DW_AT_decl_file   : 3
    <8a>   DW_AT_decl_line   : 214
    <8b>   DW_AT_decl_column : 23
    <8c>   DW_AT_type        : <0x2d>
 <1><90>: Abbrev Number: 3 (DW_TAG_base_type)
    <91>   DW_AT_byte_size   : 8
    <92>   DW_AT_encoding    : 4	(float)
    <93>   DW_AT_name        : (indirect string, offset: 0x1c2): long double
 <1><97>: Abbrev Number: 1 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0xe7): __blkcnt_t
    <9c>   DW_AT_decl_file   : 4
    <9d>   DW_AT_decl_line   : 30
    <9e>   DW_AT_decl_column : 14
    <9f>   DW_AT_type        : <0x50>
 <1><a3>: Abbrev Number: 1 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x1d5): __blksize_t
    <a8>   DW_AT_decl_file   : 4
    <a9>   DW_AT_decl_line   : 34
    <aa>   DW_AT_decl_column : 14
    <ab>   DW_AT_type        : <0x50>
 <1><af>: Abbrev Number: 1 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0x1): _off_t
    <b4>   DW_AT_decl_file   : 4
    <b5>   DW_AT_decl_line   : 46
    <b6>   DW_AT_decl_column : 14
    <b7>   DW_AT_type        : <0x50>
 <1><bb>: Abbrev Number: 1 (DW_TAG_typedef)
    <bc>   DW_AT_name        : (indirect string, offset: 0x205): __pid_t
    <c0>   DW_AT_decl_file   : 4
    <c1>   DW_AT_decl_line   : 52
    <c2>   DW_AT_decl_column : 13
    <c3>   DW_AT_type        : <0x7d>
 <1><c7>: Abbrev Number: 1 (DW_TAG_typedef)
    <c8>   DW_AT_name        : (indirect string, offset: 0x121): __dev_t
    <cc>   DW_AT_decl_file   : 4
    <cd>   DW_AT_decl_line   : 56
    <ce>   DW_AT_decl_column : 15
    <cf>   DW_AT_type        : <0x42>
 <1><d3>: Abbrev Number: 1 (DW_TAG_typedef)
    <d4>   DW_AT_name        : (indirect string, offset: 0x23b): __uid_t
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 60
    <da>   DW_AT_decl_column : 24
    <db>   DW_AT_type        : <0x49>
 <1><df>: Abbrev Number: 1 (DW_TAG_typedef)
    <e0>   DW_AT_name        : (indirect string, offset: 0x8): __gid_t
    <e4>   DW_AT_decl_file   : 4
    <e5>   DW_AT_decl_line   : 63
    <e6>   DW_AT_decl_column : 24
    <e7>   DW_AT_type        : <0x49>
 <1><eb>: Abbrev Number: 1 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x22b): __ino_t
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 75
    <f2>   DW_AT_decl_column : 24
    <f3>   DW_AT_type        : <0x49>
 <1><f7>: Abbrev Number: 1 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0xde): __mode_t
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 90
    <fe>   DW_AT_decl_column : 20
    <ff>   DW_AT_type        : <0x57>
 <1><103>: Abbrev Number: 1 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0): __off_t
    <108>   DW_AT_decl_file   : 4
    <109>   DW_AT_decl_line   : 102
    <10a>   DW_AT_decl_column : 16
    <10b>   DW_AT_type        : <0xaf>
 <1><10f>: Abbrev Number: 1 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x25e): _ssize_t
    <114>   DW_AT_decl_file   : 4
    <115>   DW_AT_decl_line   : 147
    <116>   DW_AT_decl_column : 23
    <117>   DW_AT_type        : <0x7d>
 <1><11b>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <11c>   DW_AT_byte_size   : 4
 <1><11d>: Abbrev Number: 1 (DW_TAG_typedef)
    <11e>   DW_AT_name        : (indirect string, offset: 0x15b): __nlink_t
    <122>   DW_AT_decl_file   : 4
    <123>   DW_AT_decl_line   : 213
    <124>   DW_AT_decl_column : 24
    <125>   DW_AT_type        : <0x49>
 <1><129>: Abbrev Number: 1 (DW_TAG_typedef)
    <12a>   DW_AT_name        : (indirect string, offset: 0x1e1): time_t
    <12e>   DW_AT_decl_file   : 5
    <12f>   DW_AT_decl_line   : 42
    <130>   DW_AT_decl_column : 18
    <131>   DW_AT_type        : <0x71>
 <1><135>: Abbrev Number: 7 (DW_TAG_structure_type)
    <136>   DW_AT_name        : (indirect string, offset: 0x222): timespec
    <13a>   DW_AT_byte_size   : 16
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 47
    <13d>   DW_AT_decl_column : 8
    <13d>   DW_AT_sibling     : <0x15c>
 <2><141>: Abbrev Number: 2 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0x1ce): tv_sec
    <146>   DW_AT_decl_file   : 6
    <147>   DW_AT_decl_line   : 48
    <148>   DW_AT_decl_column : 9
    <149>   DW_AT_type        : <0x129>
    <14d>   DW_AT_data_member_location: 0
 <2><14e>: Abbrev Number: 2 (DW_TAG_member)
    <14f>   DW_AT_name        : (indirect string, offset: 0x1ba): tv_nsec
    <153>   DW_AT_decl_file   : 6
    <154>   DW_AT_decl_line   : 49
    <155>   DW_AT_decl_column : 7
    <156>   DW_AT_type        : <0x50>
    <15a>   DW_AT_data_member_location: 8
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 1 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0xe9): blkcnt_t
    <161>   DW_AT_decl_file   : 7
    <162>   DW_AT_decl_line   : 97
    <163>   DW_AT_decl_column : 20
    <164>   DW_AT_type        : <0x97>
 <1><168>: Abbrev Number: 1 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x1d7): blksize_t
    <16d>   DW_AT_decl_file   : 7
    <16e>   DW_AT_decl_line   : 102
    <16f>   DW_AT_decl_column : 21
    <170>   DW_AT_type        : <0xa3>
 <1><174>: Abbrev Number: 3 (DW_TAG_base_type)
    <175>   DW_AT_byte_size   : 1
    <176>   DW_AT_encoding    : 8	(unsigned char)
    <177>   DW_AT_name        : (indirect string, offset: 0x200): char
 <1><17b>: Abbrev Number: 1 (DW_TAG_typedef)
    <17c>   DW_AT_name        : (indirect string, offset: 0x22d): ino_t
    <180>   DW_AT_decl_file   : 7
    <181>   DW_AT_decl_line   : 137
    <182>   DW_AT_decl_column : 18
    <183>   DW_AT_type        : <0xeb>
 <1><187>: Abbrev Number: 1 (DW_TAG_typedef)
    <188>   DW_AT_name        : (indirect string, offset: 0x2): off_t
    <18c>   DW_AT_decl_file   : 7
    <18d>   DW_AT_decl_line   : 155
    <18e>   DW_AT_decl_column : 18
    <18f>   DW_AT_type        : <0x103>
 <1><193>: Abbrev Number: 1 (DW_TAG_typedef)
    <194>   DW_AT_name        : (indirect string, offset: 0x123): dev_t
    <198>   DW_AT_decl_file   : 7
    <199>   DW_AT_decl_line   : 159
    <19a>   DW_AT_decl_column : 18
    <19b>   DW_AT_type        : <0xc7>
 <1><19f>: Abbrev Number: 1 (DW_TAG_typedef)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x23d): uid_t
    <1a4>   DW_AT_decl_file   : 7
    <1a5>   DW_AT_decl_line   : 163
    <1a6>   DW_AT_decl_column : 18
    <1a7>   DW_AT_type        : <0xd3>
 <1><1ab>: Abbrev Number: 1 (DW_TAG_typedef)
    <1ac>   DW_AT_name        : (indirect string, offset: 0xa): gid_t
    <1b0>   DW_AT_decl_file   : 7
    <1b1>   DW_AT_decl_line   : 167
    <1b2>   DW_AT_decl_column : 18
    <1b3>   DW_AT_type        : <0xdf>
 <1><1b7>: Abbrev Number: 1 (DW_TAG_typedef)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x207): pid_t
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 172
    <1be>   DW_AT_decl_column : 18
    <1bf>   DW_AT_type        : <0xbb>
 <1><1c3>: Abbrev Number: 1 (DW_TAG_typedef)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x25f): ssize_t
    <1c8>   DW_AT_decl_file   : 7
    <1c9>   DW_AT_decl_line   : 182
    <1ca>   DW_AT_decl_column : 18
    <1cb>   DW_AT_type        : <0x10f>
 <1><1cf>: Abbrev Number: 1 (DW_TAG_typedef)
    <1d0>   DW_AT_name        : (indirect string, offset: 0xe0): mode_t
    <1d4>   DW_AT_decl_file   : 7
    <1d5>   DW_AT_decl_line   : 187
    <1d6>   DW_AT_decl_column : 18
    <1d7>   DW_AT_type        : <0xf7>
 <1><1db>: Abbrev Number: 1 (DW_TAG_typedef)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x15d): nlink_t
    <1e0>   DW_AT_decl_file   : 7
    <1e1>   DW_AT_decl_line   : 192
    <1e2>   DW_AT_decl_column : 19
    <1e3>   DW_AT_type        : <0x11d>
 <1><1e7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1e8>   DW_AT_name        : (indirect string, offset: 0xfb): stat
    <1ec>   DW_AT_byte_size   : 88
    <1ed>   DW_AT_decl_file   : 8
    <1ee>   DW_AT_decl_line   : 27
    <1ef>   DW_AT_decl_column : 8
    <1ef>   DW_AT_sibling     : <0x2aa>
 <2><1f3>: Abbrev Number: 2 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x257): st_dev
    <1f8>   DW_AT_decl_file   : 8
    <1f9>   DW_AT_decl_line   : 29
    <1fa>   DW_AT_decl_column : 10
    <1fb>   DW_AT_type        : <0x193>
    <1ff>   DW_AT_data_member_location: 0
 <2><200>: Abbrev Number: 2 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0xd7): st_ino
    <205>   DW_AT_decl_file   : 8
    <206>   DW_AT_decl_line   : 30
    <207>   DW_AT_decl_column : 10
    <208>   DW_AT_type        : <0x17b>
    <20c>   DW_AT_data_member_location: 2
 <2><20d>: Abbrev Number: 2 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x1b2): st_mode
    <212>   DW_AT_decl_file   : 8
    <213>   DW_AT_decl_line   : 31
    <214>   DW_AT_decl_column : 10
    <215>   DW_AT_type        : <0x1cf>
    <219>   DW_AT_data_member_location: 4
 <2><21a>: Abbrev Number: 2 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x1ee): st_nlink
    <21f>   DW_AT_decl_file   : 8
    <220>   DW_AT_decl_line   : 32
    <221>   DW_AT_decl_column : 11
    <222>   DW_AT_type        : <0x1db>
    <226>   DW_AT_data_member_location: 8
 <2><227>: Abbrev Number: 2 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x129): st_uid
    <22c>   DW_AT_decl_file   : 8
    <22d>   DW_AT_decl_line   : 33
    <22e>   DW_AT_decl_column : 10
    <22f>   DW_AT_type        : <0x19f>
    <233>   DW_AT_data_member_location: 10
 <2><234>: Abbrev Number: 2 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x250): st_gid
    <239>   DW_AT_decl_file   : 8
    <23a>   DW_AT_decl_line   : 34
    <23b>   DW_AT_decl_column : 10
    <23c>   DW_AT_type        : <0x1ab>
    <240>   DW_AT_data_member_location: 12
 <2><241>: Abbrev Number: 2 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x233): st_rdev
    <246>   DW_AT_decl_file   : 8
    <247>   DW_AT_decl_line   : 35
    <248>   DW_AT_decl_column : 10
    <249>   DW_AT_type        : <0x193>
    <24d>   DW_AT_data_member_location: 14
 <2><24e>: Abbrev Number: 2 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x1a3): st_size
    <253>   DW_AT_decl_file   : 8
    <254>   DW_AT_decl_line   : 36
    <255>   DW_AT_decl_column : 10
    <256>   DW_AT_type        : <0x187>
    <25a>   DW_AT_data_member_location: 16
 <2><25b>: Abbrev Number: 2 (DW_TAG_member)
    <25c>   DW_AT_name        : (indirect string, offset: 0x108): st_atim
    <260>   DW_AT_decl_file   : 8
    <261>   DW_AT_decl_line   : 42
    <262>   DW_AT_decl_column : 19
    <263>   DW_AT_type        : <0x135>
    <267>   DW_AT_data_member_location: 24
 <2><268>: Abbrev Number: 2 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x267): st_mtim
    <26d>   DW_AT_decl_file   : 8
    <26e>   DW_AT_decl_line   : 43
    <26f>   DW_AT_decl_column : 19
    <270>   DW_AT_type        : <0x135>
    <274>   DW_AT_data_member_location: 40
 <2><275>: Abbrev Number: 2 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x10): st_ctim
    <27a>   DW_AT_decl_file   : 8
    <27b>   DW_AT_decl_line   : 44
    <27c>   DW_AT_decl_column : 19
    <27d>   DW_AT_type        : <0x135>
    <281>   DW_AT_data_member_location: 56
 <2><282>: Abbrev Number: 2 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x217): st_blksize
    <287>   DW_AT_decl_file   : 8
    <288>   DW_AT_decl_line   : 45
    <289>   DW_AT_decl_column : 17
    <28a>   DW_AT_type        : <0x168>
    <28e>   DW_AT_data_member_location: 72
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0xa9): st_blocks
    <294>   DW_AT_decl_file   : 8
    <295>   DW_AT_decl_line   : 46
    <296>   DW_AT_decl_column : 12
    <297>   DW_AT_type        : <0x15c>
    <29b>   DW_AT_data_member_location: 76
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x130): st_spare4
    <2a1>   DW_AT_decl_file   : 8
    <2a2>   DW_AT_decl_line   : 48
    <2a3>   DW_AT_decl_column : 9
    <2a4>   DW_AT_type        : <0x2aa>
    <2a8>   DW_AT_data_member_location: 80
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 19 (DW_TAG_array_type)
    <2ab>   DW_AT_type        : <0x50>
    <2af>   DW_AT_sibling     : <0x2ba>
 <2><2b3>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <2b4>   DW_AT_type        : <0x2d>
    <2b8>   DW_AT_upper_bound : 1
 <2><2b9>: Abbrev Number: 0
 <1><2ba>: Abbrev Number: 21 (DW_TAG_subprogram)
    <2bb>   DW_AT_external    : 1
    <2bb>   DW_AT_name        : (indirect string, offset: 0x100): _getpid
    <2bf>   DW_AT_decl_file   : 1
    <2c0>   DW_AT_decl_line   : 13
    <2c1>   DW_AT_decl_column : 7
    <2c2>   DW_AT_prototyped  : 1
    <2c2>   DW_AT_type        : <0x1b7>
    <2c6>   DW_AT_low_pc      : 0x20000024
    <2ca>   DW_AT_high_pc     : 0x2
    <2ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2d0>   DW_AT_call_all_calls: 1
 <1><2d0>: Abbrev Number: 6 (DW_TAG_subprogram)
    <2d1>   DW_AT_external    : 1
    <2d1>   DW_AT_name        : (indirect string, offset: 0x24a): _kill
    <2d5>   DW_AT_decl_file   : 1
    <2d5>   DW_AT_decl_line   : 12
    <2d6>   DW_AT_decl_column : 5
    <2d7>   DW_AT_prototyped  : 1
    <2d7>   DW_AT_type        : <0x7d>
    <2db>   DW_AT_low_pc      : 0x20000020
    <2df>   DW_AT_high_pc     : 0x2
    <2e3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2e5>   DW_AT_call_all_calls: 1
    <2e5>   DW_AT_sibling     : <0x30a>
 <2><2e9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2ea>   DW_AT_name        : pid
    <2ee>   DW_AT_decl_file   : 1
    <2ee>   DW_AT_decl_line   : 12
    <2ef>   DW_AT_decl_column : 15
    <2f0>   DW_AT_type        : <0x7d>
    <2f4>   DW_AT_location    : 0x10 (location list)
    <2f8>   DW_AT_GNU_locviews: 0xc
 <2><2fc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2fd>   DW_AT_name        : sig
    <301>   DW_AT_decl_file   : 1
    <301>   DW_AT_decl_line   : 12
    <302>   DW_AT_decl_column : 24
    <303>   DW_AT_type        : <0x7d>
    <307>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (r1))
 <2><309>: Abbrev Number: 0
 <1><30a>: Abbrev Number: 9 (DW_TAG_subprogram)
    <30b>   DW_AT_external    : 1
    <30b>   DW_AT_name        : (indirect string, offset: 0x1e8): _read
    <30f>   DW_AT_decl_file   : 1
    <30f>   DW_AT_decl_line   : 11
    <310>   DW_AT_decl_column : 9
    <311>   DW_AT_prototyped  : 1
    <311>   DW_AT_type        : <0x1c3>
    <315>   DW_AT_sibling     : <0x33a>
 <2><319>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <31a>   DW_AT_name        : fd
    <31d>   DW_AT_decl_file   : 1
    <31d>   DW_AT_decl_line   : 11
    <31e>   DW_AT_decl_column : 19
    <31f>   DW_AT_type        : <0x7d>
 <2><323>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <324>   DW_AT_name        : buf
    <328>   DW_AT_decl_file   : 1
    <328>   DW_AT_decl_line   : 11
    <329>   DW_AT_decl_column : 29
    <32a>   DW_AT_type        : <0x11b>
 <2><32e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <32f>   DW_AT_name        : (indirect string, offset: 0x110): count
    <333>   DW_AT_decl_file   : 1
    <333>   DW_AT_decl_line   : 11
    <334>   DW_AT_decl_column : 41
    <335>   DW_AT_type        : <0x84>
 <2><339>: Abbrev Number: 0
 <1><33a>: Abbrev Number: 6 (DW_TAG_subprogram)
    <33b>   DW_AT_external    : 1
    <33b>   DW_AT_name        : (indirect string, offset: 0xf2): _lseek
    <33f>   DW_AT_decl_file   : 1
    <33f>   DW_AT_decl_line   : 10
    <340>   DW_AT_decl_column : 7
    <341>   DW_AT_prototyped  : 1
    <341>   DW_AT_type        : <0x187>
    <345>   DW_AT_low_pc      : 0x20000018
    <349>   DW_AT_high_pc     : 0x2
    <34d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <34f>   DW_AT_call_all_calls: 1
    <34f>   DW_AT_sibling     : <0x37e>
 <2><353>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <354>   DW_AT_name        : fd
    <357>   DW_AT_decl_file   : 1
    <357>   DW_AT_decl_line   : 10
    <358>   DW_AT_decl_column : 18
    <359>   DW_AT_type        : <0x7d>
